<a href="https://colab.research.google.com/github/subinmun1997/Data_Mining/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([1,3,-4,0], index=['a','b','k','z'])
obj2

a    1
b    3
k   -4
z    0
dtype: int64

In [10]:
obj2['a']

1

In [11]:
obj2['a'] = 11
obj2

a    11
b     3
k    -4
z     0
dtype: int64

In [12]:
obj2[['k','a','b']]

k    -4
a    11
b     3
dtype: int64

In [13]:
obj2.isnull()

a    False
b    False
k    False
z    False
dtype: bool

In [16]:
data = {'city' : ['Seoul','Busan','Daegu','Ulsan'],
        'year' : [2010,2011,2012,2013]}

In [17]:
frame = pd.DataFrame(data)

In [19]:
frame

    city  year
0  Seoul  2010
1  Busan  2011
2  Daegu  2012
3  Ulsan  2013

In [21]:
frame2 = pd.DataFrame(data, columns=['year','city'])
frame2

   year   city
0  2010  Seoul
1  2011  Busan
2  2012  Daegu
3  2013  Ulsan

In [22]:
frame2['city']

0    Seoul
1    Busan
2    Daegu
3    Ulsan
Name: city, dtype: object

In [24]:
frame3 = pd.DataFrame(data, index=['one','two','three','four'])
frame3

        city  year
one    Seoul  2010
two    Busan  2011
three  Daegu  2012
four   Ulsan  2013

In [27]:
frame3.T

        one    two  three   four
city  Seoul  Busan  Daegu  Ulsan
year   2010   2011   2012   2013

In [30]:
frame4 = pd.DataFrame([[1,3,2,5],[4,2,6,1]], index=['three','one'], columns=['d','a','b','c'])
frame4

       d  a  b  c
three  1  3  2  5
one    4  2  6  1

In [32]:
frame4.sort_index()

       d  a  b  c
one    4  2  6  1
three  1  3  2  5

In [34]:
frame4.sort_index(axis=1)

       a  b  c  d
three  3  2  5  1
one    2  6  1  4

In [35]:
frame4.sort_index(axis=1, ascending=False)

       d  c  b  a
three  1  5  2  3
one    4  1  6  2